import numpy as np

config = {
    "eta": 0.996,  # 結合損
    "alpha": 52.96,  # 伝搬損失係数
    "K": np.array(
        [0.3,0.3,0.3,0.3,0.3,0.3,0.3,0.3,0.3]
        
    ),  # 結合率
    "L": np.array(
        [ 8.24318182e-05, 8.24318182e-05, 8.24318182e-05, 8.24318182e-05, 8.24318182e-05, 0.000109909091, 0.000109909091, 0.000109909091]   
        
    ),  # リング周長
    "n_eff": 2.2,  # 実行屈折率
    "n_g": 4.4,  # 群屈折率
    "center_wavelength": 1550e-9,
    "lambda_limit": np.arange(1520e-9, 1560e-9, 1e-12),
}
